load_tests/websocket_file_testreport/statistics.json
{
  "Obtener lista de usuarios" : {
    "transaction" : "Obtener lista de usuarios",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.68,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 2.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 2.0,
    "throughput" : 1.8564586195373705,
    "receivedKBytesPerSec" : 78.68298909562618,
    "sentKBytesPerSec" : 0.0
  },
  "websocket accept handshake" : {
    "transaction" : "websocket accept handshake",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.019999999999999997,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.9378342764126812,
    "receivedKBytesPerSec" : 0.015139330284474072,
    "sentKBytesPerSec" : 0.0
  },
  "Join Room" : {
    "transaction" : "Join Room",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.19999999999999998,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.8511662347278786,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.14429696177341725
  },
  "Extra reader for noop" : {
    "transaction" : "Extra reader for noop",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.10000000000000003,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.8999999999999986,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.8769473328578399,
    "receivedKBytesPerSec" : 0.005498869139231953,
    "sentKBytesPerSec" : 0.0
  },
  "Salir Chat" : {
    "transaction" : "Salir Chat",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.1800000000000001,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.7279513408902405,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.013499619850705004
  },
  "Verificar sala y pin" : {
    "transaction" : "Verificar sala y pin",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 278.91999999999996,
    "medianResTime" : 179.5,
    "minResTime" : 172.0,
    "maxResTime" : 855.0,
    "pct1ResTime" : 529.9,
    "pct2ResTime" : 788.7499999999997,
    "pct3ResTime" : 855.0,
    "throughput" : 2.011667672500503,
    "receivedKBytesPerSec" : 0.48916528364514184,
    "sentKBytesPerSec" : 0.49203348169382416
  },
  "WebSocket Open Connection" : {
    "transaction" : "WebSocket Open Connection",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 66.82000000000001,
    "medianResTime" : 11.0,
    "minResTime" : 1.0,
    "maxResTime" : 742.0,
    "pct1ResTime" : 196.49999999999994,
    "pct2ResTime" : 309.59999999999997,
    "pct3ResTime" : 742.0,
    "throughput" : 1.9797275894836872,
    "receivedKBytesPerSec" : 0.24939927640956605,
    "sentKBytesPerSec" : 0.4704946349382325
  },
  "Send Message" : {
    "transaction" : "Send Message",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.10000000000000003,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.8999999999999986,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.7972681524083394,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.19833134884974837
  },
  "Recibir Mensaje" : {
    "transaction" : "Recibir Mensaje",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.05999999999999999,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.761245552854979,
    "receivedKBytesPerSec" : 0.1877171285533129,
    "sentKBytesPerSec" : 0.0
  },
  "Recibir notificacion de ingreso" : {
    "transaction" : "Recibir notificacion de ingreso",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.019999999999999997,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.8847299182027215,
    "receivedKBytesPerSec" : 3.267871362471258,
    "sentKBytesPerSec" : 0.0
  },
  "Web socket handshake" : {
    "transaction" : "Web socket handshake",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.10000000000000003,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.8999999999999986,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.951524140353616,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.02286942351976894
  },
  "Obtener lista de usuarios-0" : {
    "transaction" : "Obtener lista de usuarios-0",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.42,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.856596487319446,
    "receivedKBytesPerSec" : 78.39359004260889,
    "sentKBytesPerSec" : 0.0
  },
  "Debug Sampler" : {
    "transaction" : "Debug Sampler",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.4600000000000001,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 2.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 2.0,
    "throughput" : 1.9776134161294148,
    "receivedKBytesPerSec" : 37.92154838478424,
    "sentKBytesPerSec" : 0.0
  },
  "websocket greet and accept" : {
    "transaction" : "websocket greet and accept",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.06000000000000001,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.8581834398691839,
    "receivedKBytesPerSec" : 0.061697497026906495,
    "sentKBytesPerSec" : 0.0
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 1050,
    "errorCount" : 50,
    "errorPct" : 4.7619047,
    "meanResTime" : 34.17714285714285,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1167.0,
    "pct1ResTime" : 122.79999999999995,
    "pct2ResTime" : 200.44999999999993,
    "pct3ResTime" : 680.47,
    "throughput" : 23.02278159054531,
    "receivedKBytesPerSec" : 125.1260128996097,
    "sentKBytesPerSec" : 1146.6498298301249
  },
  "WebSocket Close" : {
    "transaction" : "WebSocket Close",
    "sampleCount" : 50,
    "errorCount" : 50,
    "errorPct" : 100.0,
    "meanResTime" : 0.0,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 0.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : 1.712622024319233,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.051846955814351774
  },
  "websocket confirm handshake" : {
    "transaction" : "websocket confirm handshake",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.2,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.9061415881971715,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.0130302647630666
  },
  "Cargar archivo" : {
    "transaction" : "Cargar archivo",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 279.18000000000006,
    "medianResTime" : 142.0,
    "minResTime" : 10.0,
    "maxResTime" : 1167.0,
    "pct1ResTime" : 744.9999999999999,
    "pct2ResTime" : 870.5999999999997,
    "pct3ResTime" : 1167.0,
    "throughput" : 1.8300940668350354,
    "receivedKBytesPerSec" : 0.7342180122433293,
    "sentKBytesPerSec" : 1912.439363836426
  },
  "Muestreador BeanShell" : {
    "transaction" : "Muestreador BeanShell",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.1800000000000004,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 6.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.4499999999999957,
    "pct3ResTime" : 6.0,
    "throughput" : 1.7507615812878603,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.0
  },
  "HTTP Request" : {
    "transaction" : "HTTP Request",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 74.1,
    "medianResTime" : 51.5,
    "minResTime" : 1.0,
    "maxResTime" : 618.0,
    "pct1ResTime" : 169.2,
    "pct2ResTime" : 228.59999999999954,
    "pct3ResTime" : 618.0,
    "throughput" : 1.9851510699964268,
    "receivedKBytesPerSec" : 0.5815872275380156,
    "sentKBytesPerSec" : 0.3475177546948823
  },
  "Ask for connection" : {
    "transaction" : "Ask for connection",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.12000000000000002,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.877581674802854,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.014668606834397297
  },
  "Recibir confirmación \"room_joined\"" : {
    "transaction" : "Recibir confirmación \"room_joined\"",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 14.800000000000004,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 221.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 193.74999999999994,
    "pct3ResTime" : 221.0,
    "throughput" : 1.899696048632219,
    "receivedKBytesPerSec" : 14.060793241831307,
    "sentKBytesPerSec" : 0.0
  }
}