load_tests/websocket_file_upload_max/statistics.json
{
  "Obtener lista de usuarios" : {
    "transaction" : "Obtener lista de usuarios",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.5999999999999999,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 5.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.4499999999999957,
    "pct3ResTime" : 5.0,
    "throughput" : 1.9559519618198178,
    "receivedKBytesPerSec" : 90.85775064301922,
    "sentKBytesPerSec" : 0.0
  },
  "websocket accept handshake" : {
    "transaction" : "websocket accept handshake",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.039999999999999994,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.44999999999999574,
    "pct3ResTime" : 1.0,
    "throughput" : 2.043652415597155,
    "receivedKBytesPerSec" : 0.015966034496852775,
    "sentKBytesPerSec" : 0.0
  },
  "Join Room" : {
    "transaction" : "Join Room",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.05999999999999999,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.9649453745185885,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.1531659568301501
  },
  "Extra reader for noop" : {
    "transaction" : "Extra reader for noop",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.06000000000000001,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 2.0012007204322595,
    "receivedKBytesPerSec" : 0.005862892735641385,
    "sentKBytesPerSec" : 0.0
  },
  "Salir Chat" : {
    "transaction" : "Salir Chat",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.16,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 4.0,
    "pct1ResTime" : 0.8999999999999986,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 4.0,
    "throughput" : 1.9178397453108817,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.014983123010241264
  },
  "Verificar sala y pin" : {
    "transaction" : "Verificar sala y pin",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 262.18,
    "medianResTime" : 183.5,
    "minResTime" : 172.0,
    "maxResTime" : 703.0,
    "pct1ResTime" : 498.3999999999999,
    "pct2ResTime" : 661.9,
    "pct3ResTime" : 703.0,
    "throughput" : 2.0031248748046955,
    "receivedKBytesPerSec" : 0.48708798225231364,
    "sentKBytesPerSec" : 0.4900222472056408
  },
  "WebSocket Open Connection" : {
    "transaction" : "WebSocket Open Connection",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 83.77999999999997,
    "medianResTime" : 75.5,
    "minResTime" : 0.0,
    "maxResTime" : 374.0,
    "pct1ResTime" : 185.9,
    "pct2ResTime" : 274.84999999999997,
    "pct3ResTime" : 374.0,
    "throughput" : 2.0764119601328903,
    "receivedKBytesPerSec" : 0.2615792410714286,
    "sentKBytesPerSec" : 0.49355338974252494
  },
  "Send Message" : {
    "transaction" : "Send Message",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.12000000000000002,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.918281220026856,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.2379118309994245
  },
  "Recibir Mensaje" : {
    "transaction" : "Recibir Mensaje",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.08,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.9252242886296254,
    "receivedKBytesPerSec" : 0.19838834661738092,
    "sentKBytesPerSec" : 0.0
  },
  "Recibir notificacion de ingreso" : {
    "transaction" : "Recibir notificacion de ingreso",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.04,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.44999999999999574,
    "pct3ResTime" : 1.0,
    "throughput" : 1.952286127054781,
    "receivedKBytesPerSec" : 3.5411877464761234,
    "sentKBytesPerSec" : 0.0
  },
  "Web socket handshake" : {
    "transaction" : "Web socket handshake",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.08,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 2.084201750729471,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.024424239266360986
  },
  "Obtener lista de usuarios-0" : {
    "transaction" : "Obtener lista de usuarios-0",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.3399999999999999,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 5.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 5.0,
    "throughput" : 1.9560284797746657,
    "receivedKBytesPerSec" : 90.5533069717745,
    "sentKBytesPerSec" : 0.0
  },
  "Debug Sampler" : {
    "transaction" : "Debug Sampler",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.26000000000000006,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 2.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 2.0,
    "throughput" : 2.0312817387771687,
    "receivedKBytesPerSec" : 38.958555504773514,
    "sentKBytesPerSec" : 0.0
  },
  "websocket greet and accept" : {
    "transaction" : "websocket greet and accept",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.0,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 0.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : 1.9735543714229324,
    "receivedKBytesPerSec" : 0.06552817248865206,
    "sentKBytesPerSec" : 0.0
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 1050,
    "errorCount" : 50,
    "errorPct" : 4.7619047,
    "meanResTime" : 27.468571428571387,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 819.0,
    "pct1ResTime" : 108.0,
    "pct2ResTime" : 177.0,
    "pct3ResTime" : 473.3700000000001,
    "throughput" : 23.575903181624266,
    "receivedKBytesPerSec" : 138.91035297898378,
    "sentKBytesPerSec" : 11113.32815183864
  },
  "WebSocket Close" : {
    "transaction" : "WebSocket Close",
    "sampleCount" : 50,
    "errorCount" : 50,
    "errorPct" : 100.0,
    "meanResTime" : 0.0,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 0.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : 1.9213772432079315,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.058166693886177616
  },
  "websocket confirm handshake" : {
    "transaction" : "websocket confirm handshake",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.14,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 2.0313642642398633,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.013886279150077192
  },
  "Cargar archivo" : {
    "transaction" : "Cargar archivo",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 156.92000000000004,
    "medianResTime" : 62.0,
    "minResTime" : 34.0,
    "maxResTime" : 819.0,
    "pct1ResTime" : 478.7,
    "pct2ResTime" : 593.9999999999998,
    "pct3ResTime" : 819.0,
    "throughput" : 1.91270418117134,
    "receivedKBytesPerSec" : 0.8140573596075131,
    "sentKBytesPerSec" : 18932.255604223254
  },
  "Muestreador BeanShell" : {
    "transaction" : "Muestreador BeanShell",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.16,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 7.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 7.0,
    "throughput" : 1.937759175289695,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.0
  },
  "HTTP Request" : {
    "transaction" : "HTTP Request",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 70.64,
    "medianResTime" : 43.0,
    "minResTime" : 0.0,
    "maxResTime" : 334.0,
    "pct1ResTime" : 167.8,
    "pct2ResTime" : 235.04999999999978,
    "pct3ResTime" : 334.0,
    "throughput" : 2.0347535913400887,
    "receivedKBytesPerSec" : 0.5961192162129166,
    "sentKBytesPerSec" : 0.35667799770072844
  },
  "Ask for connection" : {
    "transaction" : "Ask for connection",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.10000000000000003,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.8999999999999986,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 2.006662118232532,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.015677047798691654
  },
  "Recibir confirmación \"room_joined\"" : {
    "transaction" : "Recibir confirmación \"room_joined\"",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.08000000000000002,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.9506105410993642,
    "receivedKBytesPerSec" : 17.084871978991924,
    "sentKBytesPerSec" : 0.0
  }
}