load_tests/websocket_test_reports/statistics.json
{
  "Obtener lista de usuarios" : {
    "transaction" : "Obtener lista de usuarios",
    "sampleCount" : 50,
    "errorCount" : 8,
    "errorPct" : 16.0,
    "meanResTime" : 0.3600000000000001,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 3.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 3.0,
    "throughput" : 1.8884314688219965,
    "receivedKBytesPerSec" : 37.66590903189561,
    "sentKBytesPerSec" : 0.0
  },
  "websocket accept handshake" : {
    "transaction" : "websocket accept handshake",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.04000000000000001,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.44999999999999574,
    "pct3ResTime" : 1.0,
    "throughput" : 1.9741777549650572,
    "receivedKBytesPerSec" : 0.015423263710664508,
    "sentKBytesPerSec" : 0.0
  },
  "Join Room" : {
    "transaction" : "Join Room",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.10000000000000003,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.8999999999999986,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.9342359767891684,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.1507721832688588
  },
  "Extra reader for noop" : {
    "transaction" : "Extra reader for noop",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.02000000000000001,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.8994073848959125,
    "receivedKBytesPerSec" : 0.005564670072937243,
    "sentKBytesPerSec" : 0.0
  },
  "Salir Chat" : {
    "transaction" : "Salir Chat",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.22,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.856596487319446,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.01450466005718317
  },
  "Verificar sala y pin" : {
    "transaction" : "Verificar sala y pin",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 265.82,
    "medianResTime" : 181.5,
    "minResTime" : 173.0,
    "maxResTime" : 639.0,
    "pct1ResTime" : 529.8,
    "pct2ResTime" : 542.45,
    "pct3ResTime" : 639.0,
    "throughput" : 2.022735547554513,
    "receivedKBytesPerSec" : 0.4622266778591367,
    "sentKBytesPerSec" : 0.4947800780775921
  },
  "WebSocket Open Connection" : {
    "transaction" : "WebSocket Open Connection",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 83.38000000000005,
    "medianResTime" : 47.0,
    "minResTime" : 1.0,
    "maxResTime" : 369.0,
    "pct1ResTime" : 229.39999999999998,
    "pct2ResTime" : 290.4999999999996,
    "pct3ResTime" : 369.0,
    "throughput" : 1.9913178541558805,
    "receivedKBytesPerSec" : 0.2508593781114341,
    "sentKBytesPerSec" : 0.4734435984109283
  },
  "Send Message" : {
    "transaction" : "Send Message",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.14000000000000004,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.8537055574092611,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.10499504133763393
  },
  "Recibir Mensaje" : {
    "transaction" : "Recibir Mensaje",
    "sampleCount" : 50,
    "errorCount" : 47,
    "errorPct" : 94.0,
    "meanResTime" : 0.019999999999999997,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.859911468214113,
    "receivedKBytesPerSec" : 0.4346090001115947,
    "sentKBytesPerSec" : 0.0
  },
  "Recibir notificacion de ingreso" : {
    "transaction" : "Recibir notificacion de ingreso",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.06000000000000001,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.8975332068311195,
    "receivedKBytesPerSec" : 1.653151684060721,
    "sentKBytesPerSec" : 0.0
  },
  "Web socket handshake" : {
    "transaction" : "Web socket handshake",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.10000000000000003,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.8999999999999986,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.9981616912440556,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.023415957319266274
  },
  "Obtener lista de usuarios-0" : {
    "transaction" : "Obtener lista de usuarios-0",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.26,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.8885741265344667,
    "receivedKBytesPerSec" : 36.80355140462701,
    "sentKBytesPerSec" : 0.0
  },
  "Debug Sampler" : {
    "transaction" : "Debug Sampler",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.27999999999999986,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 2.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 2.0,
    "throughput" : 2.0473343706494145,
    "receivedKBytesPerSec" : 39.25071880630169,
    "sentKBytesPerSec" : 0.0
  },
  "websocket greet and accept" : {
    "transaction" : "websocket greet and accept",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.05999999999999999,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.9367083704535772,
    "receivedKBytesPerSec" : 0.06430477011271643,
    "sentKBytesPerSec" : 0.0
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 950,
    "errorCount" : 127,
    "errorPct" : 13.368421,
    "meanResTime" : 21.608421052631567,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 639.0,
    "pct1ResTime" : 55.19999999999982,
    "pct2ResTime" : 176.0,
    "pct3ResTime" : 387.2700000000002,
    "throughput" : 22.374526013330506,
    "receivedKBytesPerSec" : 73.09871269194987,
    "sentKBytesPerSec" : 1.0087626813514212
  },
  "WebSocket Close" : {
    "transaction" : "WebSocket Close",
    "sampleCount" : 50,
    "errorCount" : 50,
    "errorPct" : 100.0,
    "meanResTime" : 0.0,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 0.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : 1.8826718879433693,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.056994949732660595
  },
  "websocket confirm handshake" : {
    "transaction" : "websocket confirm handshake",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.18000000000000005,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.9553400336318485,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.013366582261155214
  },
  "HTTP Request" : {
    "transaction" : "HTTP Request",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 59.38000000000001,
    "medianResTime" : 28.5,
    "minResTime" : 1.0,
    "maxResTime" : 251.0,
    "pct1ResTime" : 146.9,
    "pct2ResTime" : 208.45,
    "pct3ResTime" : 251.0,
    "throughput" : 2.0855057351407718,
    "receivedKBytesPerSec" : 0.6109880083420229,
    "sentKBytesPerSec" : 0.36541156152241916
  },
  "Ask for connection" : {
    "transaction" : "Ask for connection",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.05999999999999999,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.939487975174554,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.015152249806051201
  },
  "Recibir confirmación \"room_joined\"" : {
    "transaction" : "Recibir confirmación \"room_joined\"",
    "sampleCount" : 50,
    "errorCount" : 22,
    "errorPct" : 44.0,
    "meanResTime" : 0.08000000000000002,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.9017914875813016,
    "receivedKBytesPerSec" : 3.1816377277395307,
    "sentKBytesPerSec" : 0.0
  }
}